UrOyou/mks_stepmotor_stm32f4/mksf4nofreertos/user_code/device/mks.c
/**
  ****************************(C) COPYRIGHT 2026 ${COMPANY}****************************
  * @file       mksmotor.cpp
  * @brief      ${DESCRIPTION}
  *             mks步进电机驱动hal库f4可用版本
  * @note       
  * @history
  *  Version    Date            Author          Modification
  *  V1.0.0     04-10-2026      youg            1. 初始版本
  *
  @verbatim
  ==============================================================================
    ${USAGE_NOTES}
  ==============================================================================
  @endverbatim
  ****************************(C) COPYRIGHT 2026 ${COMPANY}****************************
  */

#include "mks.h"
#include "core_cm4.h"
#include "stm32f4xx_hal.h"
#include "main.h"
#include "can.h"
#include "string.h"

typedef unsigned char boolean_t;
boolean_t CAN_RxDone = 0;
uint16_t  CAN_ID;
extern CAN_HandleTypeDef hcan1;
CAN_TxHeaderTypeDef motor_can_tx_msg;
CAN_RxHeaderTypeDef motor_can_rx_msg;
uint8_t txBuffer[8];
uint8_t rxBuffer[8];
extern TIM_HandleTypeDef htim3;

/************************  使能脉冲 ***********************************************/
uint8_t stpStatus = 0;

void mksPulseInit(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* 1. 时钟改为 GPIOB（AHB1 总线） */
    __HAL_RCC_GPIOB_CLK_ENABLE();

    /* 2. 引脚改为 PB6/PB7/PB8 */
    GPIO_InitStruct.Pin   = En_PIN | Stp_PIN | Dir_PIN;  // 即 PB6 | PB7 | PB8
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;        // 保持 50 MHz 不变

    /* 3. 初始化端口改为 GPIOB */
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* 后续电平设置与定时器初始化保持不变 */
    HAL_GPIO_WritePin(En_PORT,  En_PIN,  GPIO_PIN_SET);
    HAL_GPIO_WritePin(Dir_PORT, Dir_PIN, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(Stp_PORT, Stp_PIN, GPIO_PIN_RESET);

    // MX_TIM3_Init( );
}

void mksPulseRun(void)
{
    HAL_GPIO_WritePin(En_PORT,  En_PIN,  GPIO_PIN_RESET); // En 置低电平
    HAL_GPIO_WritePin(Dir_PORT, Dir_PIN, GPIO_PIN_SET);   // Dir 置高电平
                                                          // （原注释“置低”有误，此处保持原逻辑）

    __HAL_TIM_ENABLE(&htim3);                             // 使能 TIM3，翻转 Stp 产生脉冲
    /* 若采用纯 HAL 函数风格，也可使用：HAL_TIM_Base_Start(&htim3); */
}

/************************************************************************************/


//返回位置参数指针
//return 电机参数结构体...
const int32_t *readRealTimeLocation(uint8_t slaveAddr)
{
    static int32_t realTimeLocation;  // 静态变量，函数返回后仍然有效
    uint32_t send_mail_box;
    // 参数检查  无效地址 
    if(slaveAddr == 0) {return NULL;  }
    // 配置 CAN 消息
    motor_can_tx_msg.StdId = slaveAddr;
    motor_can_tx_msg.IDE = CAN_ID_STD;
    motor_can_tx_msg.RTR = CAN_RTR_DATA;
    motor_can_tx_msg.DLC = 0x02;
    txBuffer[0] = 0x31;  // 功能码：读取位置
    
    // 发送请求
    if(HAL_CAN_AddTxMessage(&hcan1, &motor_can_tx_msg, txBuffer, &send_mail_box) != HAL_OK) {
        return NULL;  // 发送失败
    }
    
    // 等待接收完成（需要超时机制）
    uint32_t timeout = HAL_GetTick() + 100;  // 100ms 超时
    while(HAL_CAN_GetRxMessage(&hcan1, CAN_RX_FIFO0, &motor_can_rx_msg, rxBuffer) != HAL_OK) {
        if(HAL_GetTick() > timeout) {
            return NULL;  // 接收超时
        }
    }
    
    // 解析数据（修正字节拼接，避免符号扩展）
    realTimeLocation = (int32_t)(
        ((uint32_t)rxBuffer[3] << 24) | 
        ((uint32_t)rxBuffer[4] << 16) | 
        ((uint32_t)rxBuffer[5] << 8)  | 
        ((uint32_t)rxBuffer[6])
    );
    return &realTimeLocation;  // 返回静态变量的地址
}

/* 通用 CRC：addr=从机地址，data=数据域指针，len=数据域长度（不含CRC时len=数据个数，含CRC时len=总长度） */
static uint8_t calcCRC(uint8_t addr, uint8_t *data, uint8_t len)
{
    uint16_t sum = addr;
    for (uint8_t i = 0; i < len; i++) {
        sum += data[i];
    }
    return (uint8_t)(sum & 0xFF);
}

void setMotorEnable(uint8_t slaveAddr, uint8_t enable)
{
    uint32_t mailbox;
    uint8_t data[3];

    memset(&motor_can_tx_msg, 0, sizeof(motor_can_tx_msg));
    motor_can_tx_msg.StdId = slaveAddr;
    motor_can_tx_msg.IDE = CAN_ID_STD;
    motor_can_tx_msg.RTR = CAN_RTR_DATA;
    motor_can_tx_msg.DLC = 3;

    data[0] = 0xF3;       // 功能码：使能控制
    data[1] = enable;      // 0x00=关闭, 0x01=使能
    data[2] = calcCRC(slaveAddr, data, 2);

    HAL_CAN_AddTxMessage(&hcan1, &motor_can_tx_msg, data, &mailbox);
    HAL_Delay(50);
}
/* 使用示例：setMotorEnable(1, 1);  // 使能 */

/*
功能：串口发送速度模式运行指令
输入：slaveAddr 从机地址
      dir       运行方向
      speed     运行速度
      acc       加速度
*/
void speedModeRun(uint8_t slaveAddr,uint8_t dir,uint16_t speed,uint8_t acc)
{
  uint32_t send_mail_box;
  motor_can_tx_msg.StdId = slaveAddr;
  motor_can_tx_msg.IDE = CAN_ID_STD;
  motor_can_tx_msg.RTR = CAN_RTR_DATA;
  motor_can_tx_msg.DLC = 0x05;
	//CAN_ID = slaveAddr;				//ID

  // memset(&motor_can_tx_msg, 0, sizeof(motor_can_tx_msg));
  txBuffer[0] = 0xF6;       //功能码
  txBuffer[1] = (dir<<7) | ((speed>>8)&0x0F); //方向和速度高4位
  txBuffer[2] = speed&0x00FF;   //速度低8位
  txBuffer[3] = acc;            //加速度

	txBuffer[4] = calcCRC(slaveAddr,txBuffer,4);

  HAL_CAN_AddTxMessage(&hcan1, &motor_can_tx_msg, txBuffer, &send_mail_box);

    
  // 检查邮箱空闲数
  uint32_t free = HAL_CAN_GetTxMailboxesFreeLevel(&hcan1);
    
  // 检查错误状态
  uint32_t err = HAL_CAN_GetError(&hcan1);
  uint32_t esr = hcan1.Instance->ESR;
  // uint32_t lec = (esr >> 24) & 0x07;  // Last Error Code
    
  // 组装报文...
  HAL_StatusTypeDef status = HAL_CAN_AddTxMessage(&hcan1, &motor_can_tx_msg, txBuffer, &send_mail_box);
    
  if (status != HAL_OK) {
      // 如果走到这里，说明邮箱满了或参数错误
      // 在 err 和 lec 上打断点
      // __BKPT(0);  // 触发断点
  }
}

/**
 * @brief   发送位置模式1运行指令（MKS电机协议）
 * @param   slaveAddr   从机地址（CAN帧ID）
 * @param   dir         运行方向（0=正转，1=反转）
 * @param   speed       运行速度（RPM，范围0-3000）
 * @param   acc         加速度（单位根据电机固件）
 * @param   pulses      目标脉冲数（24位有效，最大0xFFFFFF）
 * @retval  无
 * @note    数据格式：FD + [DIR+SPEED_H] + [SPEED_L] + [ACC] + [PULSES_23:16] + [PULSES_15:8] + [PULSES_7:0] + [CRC]
 */
void positionMode1Run(uint8_t slaveAddr, uint8_t dir, uint16_t speed, uint8_t acc, uint32_t pulses)
{
  
  uint32_t send_mail_box;
  motor_can_tx_msg.StdId = slaveAddr;
  motor_can_tx_msg.IDE = CAN_ID_STD;
  motor_can_tx_msg.RTR = CAN_RTR_DATA;
  motor_can_tx_msg.DLC = 0x08;

  // CAN_ID = slaveAddr;                 // 设置全局CAN ID，供CRC计算和发送使用
  txBuffer[0] = 0xFD;                 // 功能码：0xFD = 位置模式1指令（MKS协议定义）
  txBuffer[1] = (dir << 7) | ((speed >> 8) & 0x0F);
  // 位域：[7]方向位（1=反转，0=正转），[6:4]保留，[3:0]速度高4位
  txBuffer[2] = speed & 0xFF;         // 速度低8位，与txBuffer[1]的低4位组成12位速度值（0-4095，实际用0-3000 RPM）
  txBuffer[3] = acc;                  // 加速度参数，数值越大加速越快（电机固件解析）
  txBuffer[4] = (pulses >> 16) & 0xFF;    // 脉冲数第3字节（bit23:16）
  txBuffer[5] = (pulses >> 8) & 0xFF;     // 脉冲数第2字节（bit15:8）
  txBuffer[6] = pulses & 0xFF;            // 脉冲数第1字节（bit7:0）
  // CanTransfer(txBuffer, 8);           // 发送8字节帧（实际数据7字节+1字节CRC）
  HAL_CAN_AddTxMessage(&hcan1, &motor_can_tx_msg, txBuffer, &send_mail_box);

}

/**
 * @brief   配置NVIC控制器（CAN1 RX0中断）
 * @param   无
 * @retval  无
 * @note    抢占优先级2位，响应优先级2位（共4位优先级）
 */
void NVIC_INIT(void)
{
  HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_2);  // 设置优先级分组：2位抢占，2位子优先级
  HAL_NVIC_SetPriority(CAN1_RX0_IRQn, 0, 0);  // 设置中断优先级：抢占=0，子优先级=0
  // F4中CAN1_RX0_IRQn对应原USB_LP_CAN1_RX0_IRQn
  HAL_NVIC_EnableIRQ(CAN1_RX0_IRQn);          // 使能中断
}




/**
 * @brief   等待下位机应答，设置超时时间为3000ms
 * @param   delayTime   等待时间(ms)，为0时无限等待
 * @retval  位置模式1控制开始    1
 *          位置模式1控制完成    2
 *          位置模式1控制失败    0
 *          超时无应答           0
 * @note    数据格式：FD + [DIR+SPEED_H] + [SPEED_L] + [ACC] + [PULSES_23:16] + [PULSES_15:8] + [PULSES_7:0] + [CRC]
 */
boolean_t waitingForACK(void)
{
  boolean_t retVal = 0; //返回值
  unsigned long sTime;  		//计时起始时刻
  unsigned long time;  			//当前时刻
  uint8_t rxByte;      
	
  sTime = HAL_GetTick();    //获取当前时刻
  while(1)
  {
		if(CAN_RxDone == 1)  //CAN接收到数据
		{
			CAN_RxDone = 0;

			rxByte = CanRxHeader.DLC;
			CAN_ID = CanRxHeader.StdId;

			if(CanRxData[rxByte-1] == calcCRC(CAN_ID,CanRxData,rxByte-1))
			{
				retVal = 1;   //校验正确
				break;
			}				
		}

    time = HAL_GetTick();
    if(((time - sTime) > 3000))   //判断是否超时
    {
      retVal = 0;
      break;                    //超时，退出while(1)
    }
  }
  return(retVal);
}
